package site.javadev.lesson_2.homework;
//Дано: Хитрый бухгалтер разделил 5 рублей на 2 кассы. Сколько рублей лежит в каждой кассе?
//Вывести на косоль
public class Task1 {

    public static void main(String[] args) {

        double sum = 5;
        double cashDesk1 = sum/2;
        double cashDesk2 = sum/2;

        System.out.println(cashDesk1);
        System.out.println(cashDesk2);
    }

}
