package site.javadev.lesson_03.online;

public class Main {
    public static void main(String[] args) {
        /**
            Арифметические операторы
            + Складывает значения по обе стороны от оператора
            - Вычитает правый операнд из левого операнда
            * Умножает значения по обе стороны от оператора
            / Оператор деления делит левый операнд на правый операнд
            % Делит левый операнд на правый операнд и возвращает остаток
            ++ Инкремент - увеличивает значение операнда на 1 х++ постфиксная, ++х префиксная
            -- Декремент - уменьшает значение операнда на 1 х-- постфиксная, --х префиксная
        */
        /**
         * Операторы сравнения
         *
         * == Проверяет, равны или нет значения двух операндов, если да,
         * то условие становится истинным (A == B) – не верны
         *
         * != Проверяет, равны или нет значения двух операндов,
         * если значения не равны, то условие становится истинным (A != B) – значение истинна
         *
         * > Проверяет, является ли значение левого операнда больше,
         * чем значение правого операнда, если да, то условие становится истинным (A > B) – не верны
         *
         * < Проверяет, является ли значение левого операнда меньше,
         * чем значение правого операнда, если да, то условие становится истинным (A < B) – значение истинна
         *
         * >= Проверяет, является ли значение левого операнда больше или равно значению правого операнда,
         * если да, то условие становится истинным (A >= B) – значение не верны
         *
         * <= Проверяет, если значение левого операнда меньше или равно значению правого операнда,
         * если да, то условие становится истинным (A <= B) – значение истинна
         * */

        /**
         Логические операторы

         && Называется логический оператор «И». Если оба операнда являются не равны нулю, то условие становится истинным
         || Называется логический оператор «ИЛИ». Если любой из двух операндов не равен нулю, то условие становится истинным
         ! Называется логический оператор «НЕ». Использование меняет логическое состояние своего операнда.
         Если условие имеет значение true, то оператор логического «НЕ» будет делать false
         */
    }
}
